# DataSet

### Importing Packages

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.dates as mdates

### Turning CSVs into DataFrames

In [2]:
Activity_Data = pd.read_csv('NLA Customer Flight Activity.csv')
History_Data = pd.read_csv('NLA Customer Loyalty History.csv')

In [3]:
Activity_df = pd.DataFrame(Activity_Data)
History_df = pd.DataFrame(History_Data)

In [4]:
Activity_df

,Loyalty Number,Year,Month,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2018,12,5,12060,12060.0,0,0
1,100018,2017,11,4,2028,2028.0,0,0
2,100018,2017,3,4,9648,9648.0,438,79
3,100018,2018,9,4,8932,8932.0,0,0
4,100018,2017,7,3,3687,3687.0,0,0
...,...,...,...,...,...,...,...,...
392859,999986,2018,4,0,0,0.0,0,0
392860,999986,2018,5,0,0,0.0,0,0
392861,999986,2018,6,0,0,0.0,0,0
392862,999986,2018,9,0,0,0.0,0,0
392863,999986,2018,12,0,0,0.0,0,0

In [ ]:
History_df

,Loyalty Number,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16732,823768,British Columbia,Vancouver,V6E 3Z3,Female,College,NaN,Married,Star,61850.19,Standard,2012,12,NaN,NaN
16733,680886,Saskatchewan,Regina,S1J 3C5,Female,Bachelor,89210.0,Married,Star,67907.27,Standard,2014,9,NaN,NaN
16734,776187,British Columbia,Vancouver,V5R 1W3,Male,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN
16735,906428,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,-57297.0,Married,Star,10018.66,2018 Promotion,2018,4,NaN,NaN
16736,652627,Manitoba,Winnipeg,R2C 0M5,Female,Bachelor,75049.0,Married,Star,83325.38,Standard,2015,12,2016.0,8.0

###### * Calendar table is unnecessary.
###### * Columns Start of Year/Quarter/Month and redundant and can be extracted from the Date.
###### * Time-related parameters in other tables are in month and year level only, so the Calendar could've been in YYYY-MM format (and 30 times smaller).

# Data Basic Information

### DataTypes

In [6]:
Activity_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 392864 entries, 0 to 392863
Data columns (total 8 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               392864 non-null  int64
 1   Year                         392864 non-null  int64
 2   Month                        392864 non-null  int64
 3   Total Flights                392864 non-null  int64
 4   Distance                     392864 non-null  int64
 5   Points Accumulated           392864 non-null  float64
 6   Points Redeemed              392864 non-null  int64
 7   Dollar Cost Points Redeemed  392864 non-null  int64
dtypes: float64(1), int64(7)
memory usage: 24.0 MB

In [7]:
History_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Province            16737 non-null  object
 2   City                16737 non-null  object
 3   Postal Code         16737 non-null  object
 4   Gender              16737 non-null  object
 5   Education           16737 non-null  object
 6   Salary              12499 non-null  float64
 7   Marital Status      16737 non-null  object
 8   Loyalty Card        16737 non-null  object
 9   CLV                 16737 non-null  float64
 10  Enrollment Type     16737 non-null  object
 11  Enrollment Year     16737 non-null  int64
 12  Enrollment Month    16737 non-null  int64
 13  Cancellation Year   2067 non-null   float64
 14  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(8)
memory usage: 1.9+ MB

###### Cancellation Year/Month shouldn't be float64 - change before analyzing
###### No reason for Points Accumulated to be float64 as well - change befor analyzing

In [8]:
Activity_df['Loyalty Number'].value_counts()

Loyalty Number
974875    48
114414    48
243741    48
407404    48
467894    48
          ..
110262    11
110142    11
112522    11
114131    11
943602    11
Name: count, Length: 16736, dtype: int64

### TimeFrames

In [9]:
History_df.sort_values(by=['Enrollment Year', 'Enrollment Month'], ascending = False).head(1)

,Loyalty Number,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
330,120613,Quebec,Hull,J8Y 3Z5,Female,College,NaN,Single,Star,4466.1,Standard,2018,12,NaN,NaN

In [10]:
Activity_df.sort_values(by=['Year', 'Month']).head(1)

,Loyalty Number,Year,Month,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
14,100018,2017,1,1,601,601.0,0,0

###### Enrollments (Loyalty History) are documented from 4-2012 to 12-2018
###### Cancellations (Loyalty History) are documented from 1-2013 to 12-2018
###### Flight Activity (Flight Activity) are documented from 1-2017 to 12-2018

### Statistics

In [11]:
Activity_df.describe().round(2)

,Loyalty Number,Year,Month,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
count,392864.00,392864.00,392864.00,392864.00,392864.00,392864.00,392864.00,392864.00
mean,550504.12,2017.51,6.51,1.30,1941.64,2027.38,31.31,5.64
std,258622.50,0.50,3.45,1.96,3240.13,3872.37,126.66,22.80
min,100018.00,2017.00,1.00,0.00,0.00,0.00,0.00,0.00
25%,327653.00,2017.00,4.00,0.00,0.00,0.00,0.00,0.00
50%,551828.00,2018.00,7.00,0.00,0.00,0.00,0.00,0.00
75%,772237.00,2018.00,10.00,2.00,3020.00,3039.00,0.00,0.00
max,999986.00,2018.00,12.00,28.00,67284.00,100926.00,876.00,158.00

In [12]:
History_df.describe().round(2)

,Loyalty Number,Salary,CLV,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
count,16737.00,12499.00,16737.00,16737.00,16737.00,2067.00,2067.00
mean,549735.88,79245.61,7988.90,2015.25,6.67,2016.50,6.96
std,258912.13,35008.30,6860.98,1.98,3.40,1.38,3.46
min,100018.00,-58486.00,1898.01,2012.00,1.00,2013.00,1.00
25%,326603.00,59246.50,3980.84,2014.00,4.00,2016.00,4.00
50%,550434.00,73455.00,5780.18,2015.00,7.00,2017.00,7.00
75%,772019.00,88517.50,8940.58,2017.00,10.00,2018.00,10.00
max,999986.00,407228.00,83325.38,2018.00,12.00,2018.00,12.00

###### Null values only in Cancellation Year/Month (which makes sense)
###### Salaries cannot be negative values - should clean DF before analyzing

### Customers with Negative Salaries

In [13]:
neg_salary = pd.DataFrame(columns=['Loyalty Number', 'Salary'])

for i in range(len(History_df)):
    if History_df['Salary'][i] <= 0:
        neg_salary.loc[i] = [History_df['Loyalty Number'][i].astype(str), History_df['Salary'][i]]
    else:
        pass
neg_salary.sort_values(by='Loyalty Number')

      Loyalty Number   Salary
6560          115505 -10605.0
7373          152016 -58486.0
8576          194065 -31911.0
8767          212128 -49001.0
2471          232755 -46683.0
14327         239955 -47310.0
14355         347013 -39503.0
13564         364596 -26322.0
11635         366599  -9081.0
6570          430398 -17534.0
12596         436087 -46470.0
4712          491242 -43234.0
3575          525245 -45962.0
1082          542976 -49830.0
3932          603070 -19325.0
15416         729561 -19332.0
16431         734647 -46303.0
10232         790475 -34079.0
16735         906428 -57297.0
1894          959977 -12497.0

### Finding the Key

In [14]:
Unique_Val_Activity = len(Activity_df['Loyalty Number'].unique())
Total_Val_Activity = Activity_df['Loyalty Number'].count()

Unique_Val_History = len(History_df['Loyalty Number'].unique())
Total_Val_History = History_df['Loyalty Number'].count()

print(f'Unique Values Activity: {Unique_Val_Activity}, Total Values Activity: {Total_Val_Activity}')
print(f'Unique Values History: {Unique_Val_History}, Total Values History: {Total_Val_History}')

Unique Values Activity: 16736, Total Values Activity: 392864
Unique Values History: 16737, Total Values History: 16737

###### In History table each row represents a different customer, and each Loyalty Number is unique.
###### In Activity table each row represents a different order, and some Lolyalty Numbers are repeated.
###### Joining Key will be Loyalty Number in both tables.

# Data Cleaning

### Removing Duplicate Rows

In [15]:
Activity_df['Total Flights'] = pd.to_numeric(Activity_df['Total Flights'], errors='coerce')

Activity_df_sorted = Activity_df.sort_values(
    by=['Total Flights'], 
    ascending=False
)

Activity_df_Clean = Activity_df_sorted.drop_duplicates(
    subset=['Loyalty Number', 'Year', 'Month'],
    keep='first'
)


Activity_df_Clean

,Loyalty Number,Year,Month,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
49696,214095,2018,7,28,56364,84546.0,752,135
155900,459164,2018,7,28,41160,61740.0,513,92
161179,471015,2018,7,28,56196,84294.0,0,0
4526,110065,2018,7,28,65184,97776.0,0,0
294852,772532,2018,7,28,36764,55146.0,777,140
...,...,...,...,...,...,...,...,...
392860,999986,2018,5,0,0,0.0,0,0
392861,999986,2018,6,0,0,0.0,0,0
392862,999986,2018,9,0,0,0.0,0,0
392863,999986,2018,12,0,0,0.0,0,0
134288,411242,2018,9,0,0,0.0,0,0

### Changing Data Types

In [16]:
History_df['Cancellation Year'] = History_df['Cancellation Year'].astype('Int64')
History_df['Cancellation Month'] = History_df['Cancellation Month'].astype('Int64')
Activity_df_Clean['Points Accumulated'] = Activity_df_Clean['Points Accumulated'].round().astype('Int64')

C:\Users\User\AppData\Local\Temp\ipykernel_17156\2186139381.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Activity_df_Clean['Points Accumulated'] = Activity_df_Clean['Points Accumulated'].round().astype('Int64')

### Removing Negative Salaries

In [17]:
History_df['Salary'] = History_df['Salary'].clip(lower=0)

### Adding Date Columns

In [18]:
Activity_df_Clean['Date'] = pd.to_datetime(Activity_df_Clean['Year'].astype(str) + '-' + Activity_df_Clean['Month'].astype(str) + '-01')

History_df['Enrollment Date'] = pd.to_datetime(History_df['Enrollment Year'].astype(str) + '-' + History_df['Enrollment Month'].astype(str) + '-01')

History_df['Cancellation Date'] = pd.to_datetime(
    History_df['Cancellation Year'].astype(str) + '-' +
    History_df['Cancellation Month'].astype(str) + '-01',
    errors='coerce'
)

Activity_df_Clean

C:\Users\User\AppData\Local\Temp\ipykernel_17156\3620720318.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Activity_df_Clean['Date'] = pd.to_datetime(Activity_df_Clean['Year'].astype(str) + '-' + Activity_df_Clean['Month'].astype(str) + '-01')
C:\Users\User\AppData\Local\Temp\ipykernel_17156\3620720318.py:5: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  History_df['Cancellation Date'] = pd.to_datetime(

,Loyalty Number,Year,Month,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Date
49696,214095,2018,7,28,56364,84546,752,135,2018-07-01
155900,459164,2018,7,28,41160,61740,513,92,2018-07-01
161179,471015,2018,7,28,56196,84294,0,0,2018-07-01
4526,110065,2018,7,28,65184,97776,0,0,2018-07-01
294852,772532,2018,7,28,36764,55146,777,140,2018-07-01
...,...,...,...,...,...,...,...,...,...
392860,999986,2018,5,0,0,0,0,0,2018-05-01
392861,999986,2018,6,0,0,0,0,0,2018-06-01
392862,999986,2018,9,0,0,0,0,0,2018-09-01
392863,999986,2018,12,0,0,0,0,0,2018-12-01
134288,411242,2018,9,0,0,0,0,0,2018-09-01

In [19]:
History_df_Clean = History_df

History_df_Clean.sort_values('Salary')

,Loyalty Number,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month,Enrollment Date,Cancellation Date
16735,906428,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,0.0,Married,Star,10018.66,2018 Promotion,2018,4,<NA>,<NA>,2018-04-01,NaT
11635,366599,Ontario,Toronto,M1R 4K3,Female,Bachelor,0.0,Married,Star,6915.73,2018 Promotion,2018,4,<NA>,<NA>,2018-04-01,NaT
4712,491242,British Columbia,Dawson Creek,U5I 4F1,Male,Bachelor,0.0,Married,Star,7597.91,2018 Promotion,2018,3,<NA>,<NA>,2018-03-01,NaT
13564,364596,Quebec,Tremblant,H5Y 2S9,Female,Bachelor,0.0,Single,Aurora,16710.84,2018 Promotion,2018,4,2018,12,2018-04-01,2018-12-01
6570,430398,Newfoundland,St. John's,A1C 6H9,Male,Bachelor,0.0,Married,Nova,49423.80,2018 Promotion,2018,3,<NA>,<NA>,2018-03-01,NaT
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16721,632951,Alberta,Edmonton,T9G 1W3,Female,College,NaN,Married,Star,44771.30,Standard,2018,7,<NA>,<NA>,2018-07-01,NaT
16727,546773,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Married,Star,52811.49,Standard,2015,9,<NA>,<NA>,2015-09-01,NaT
16731,900501,Ontario,Sudbury,M5V 1G5,Male,College,NaN,Single,Star,61134.68,Standard,2012,9,<NA>,<NA>,2012-09-01,NaT
16732,823768,British Columbia,Vancouver,V6E 3Z3,Female,College,NaN,Married,Star,61850.19,Standard,2012,12,<NA>,<NA>,2012-12-01,NaT
16734,776187,British Columbia,Vancouver,V5R 1W3,Male,College,NaN,Single,Star,74228.52,Standard,2014,3,<NA>,<NA>,2014-03-01,NaT

### Dates Validaion

#### Enrollment Date vs. First Activity Date

In [20]:
activity_summary = Activity_df_Clean.groupby('Loyalty Number').agg(
    First_Activity=('Date', 'min'),
    Last_Activity=('Date', 'max'),
    Activity_Row_Count=('Date', 'count')
).reset_index()

history_summary = History_df_Clean[['Loyalty Number', 'Enrollment Date', 'Cancellation Date']]

Customer_Timeline = history_summary.merge(
    activity_summary,
    on='Loyalty Number',
    how='left'
)

Customer_Timeline

,Loyalty Number,Enrollment Date,Cancellation Date,First_Activity,Last_Activity,Activity_Row_Count
0,480934,2016-02-01,NaT,2017-01-01,2018-12-01,24.0
1,549612,2016-03-01,NaT,2017-01-01,2018-12-01,24.0
2,429460,2014-07-01,2018-01-01,2017-01-01,2018-12-01,24.0
3,608370,2013-02-01,NaT,2017-01-01,2018-12-01,24.0
4,530508,2014-10-01,NaT,2017-01-01,2018-12-01,24.0
...,...,...,...,...,...,...
16732,823768,2012-12-01,NaT,2017-01-01,2018-12-01,24.0
16733,680886,2014-09-01,NaT,2017-01-01,2018-12-01,24.0
16734,776187,2014-03-01,NaT,2017-01-01,2018-12-01,24.0
16735,906428,2018-04-01,NaT,2018-02-01,2018-12-01,11.0
16736,652627,2015-12-01,2016-08-01,2017-01-01,2018-12-01,24.0

In [21]:
Customer_Timeline['Enrollment Date']>Customer_Timeline['First_Activity']

0        False
1        False
2        False
3        False
4        False
         ...
16732    False
16733    False
16734    False
16735     True
16736    False
Length: 16737, dtype: bool

In [22]:
Customers_First = Customer_Timeline[
    Customer_Timeline['First_Activity'] < Customer_Timeline['Enrollment Date']
]['Loyalty Number'].tolist()

pd.DataFrame(Customers_First)

           0
0     611765
1     172755
2     552965
3     557752
4     403361
...      ...
5009  351296
5010  753864
5011  670666
5012  632951
5013  906428

[5014 rows x 1 columns]

In [23]:
Customer_Timeline[Customer_Timeline['Loyalty Number'] == 611765]

,Loyalty Number,Enrollment Date,Cancellation Date,First_Activity,Last_Activity,Activity_Row_Count
12,611765,2018-01-01,NaT,2017-01-01,2018-12-01,24.0

###### There are 5041 customers that the first activity is prior to the enrollment date

#### Cancellation Date vs. Last Activity Date

In [24]:
Customers_Last = Customer_Timeline[
    Customer_Timeline['Last_Activity'] > Customer_Timeline['Cancellation Date']
]['Loyalty Number'].tolist()

pd.DataFrame(Customers_Last)

           0
0     429460
1     354730
2     201574
3     834891
4     733338
...      ...
1990  640285
1991  969719
1992  795743
1993  672917
1994  652627

[1995 rows x 1 columns]

In [25]:
Customer_Timeline[Customer_Timeline['Loyalty Number'] == 429460]

,Loyalty Number,Enrollment Date,Cancellation Date,First_Activity,Last_Activity,Activity_Row_Count
2,429460,2014-07-01,2018-01-01,2017-01-01,2018-12-01,24.0

# Importing Clean DBs

In [27]:
Activity_df_Clean.to_csv(r"C:\Users\User\Desktop\Data Analyst\Final Project\Git\Airline-customers-program\Activity_df_Clean.csv", index=False)
History_df_Clean.to_csv(r"C:\Users\User\Desktop\Data Analyst\Final Project\Git\Airline-customers-program\History_df_Clean.csv", index=False)
Customer_Timeline.to_csv(r"C:\Users\User\Desktop\Data Analyst\Final Project\Git\Airline-customers-program\Customer_Timeline.csv", index=False)